RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/***************************************************************************//**
* \file cy_tcpwm_motif.h
* \version 1.90
*
* The header file of the TCPWM  MOTIF driver.
*
********************************************************************************
* \copyright
* Copyright 2023-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#if !defined(CY_TCPWM_MOTIF_H)
#define CY_TCPWM_MOTIF_H

#include "cy_tcpwm.h"

#ifdef CY_IP_MXTCPWM

#if defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN)

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_tcpwm_motif
* Driver API for Motion Interface.
*
* The functions and other declarations used in this part of the driver are in cy_tcpwm_motif.h.
* You can also include cy_pdl.h to get access to all functions and declarations in the PDL.
*
* The MOTIF unit is a flexible and powerful component for motor control systems that use Rotary Encoders, Hall Sensors as feedback loop.
* The several configuration schemes of the module, target a very large universe of motor control application requirements.
* This enables the build of simple and complex control feedback loops, for industrial and automotive motor applications, targeting high performance motion and position monitoring.
*
* Each MOTIF module can operate in four different modes,
* * Quadrature Decoder
* * Hall Sensor
* * Stand-alone Multi-channel Mode
* * Quadrature mode with stand-alone Multi-channel.

*
* The MOTIF module has the following features:
* * Interface for position measurement.
* * Interface for motor revolution measurement.
* * Interface for velocity measurement.
* * Interrupt sources for phase error, motor revolution, direction change and error on phase decoding
* * Simple build-in mode for brush less DC motor control.
* * Shadow register for the multi-channel pattern.
* * Complete synchronization with the PWM signals and the multi-channel pattern update
* * Interrupt sources for Correct Hall Event detection, Wrong Hall Event Detection
* * Previous and Expected Pattern monitoring to detect less torque situations
* * Input and output Look-up table for automatic modulation control
* * Simple usage with Hall Sensor Mode
* * Stand-alone Multi-Channel mode
* * Shadow register for the multi-channel pattern
* * Output Look-up table for automatic modulation control
* * Second Compare Match (CC_MATCH1) event is only available in TCPWM Version 2.
*
* \section group_tcpwm_motif_configuration Configuration Considerations
*
* The QuadDec configuration can be divided to number of sequential
* steps listed below:
* * \ref group_tcpwm_motif_config
* * \ref group_tcpwm_motif_clock
* * \ref group_tcpwm_motif_enable
* * \ref group_tcpwm_motif_start
*
* \subsection group_tcpwm_motif_config Configure MOTIF Module
* To configure MOTIF module in HALL Sensor mode, Quadrature mode, Multi Channel Pattern mode provide the configuration parameters in the
* \ref cy_stc_tcpwm_motif_hall_sensor_config_t structure for Hall Sensor Mode.
* \ref cy_stc_tcpwm_motif_mcp_config_t structure for Multi Channel Pattern Mode.
* \ref cy_stc_tcpwm_motif_quaddec_config_t structure for Quadrature Mode.
* The Configuration structure can be modified through software, but if the configurator in ModusToolbox is used
* then the configuration structure will be updated with the users input. To initialize
* the driver, call \ref Cy_TCPWM_MOTIF_Hall_Sensor_Init \ref Cy_TCPWM_MOTIF_MCP_Init \ref Cy_TCPWM_MOTIF_Quaddec_Init function providing a pointer to the populated
* \ref cy_stc_tcpwm_motif_hall_sensor_config_t \ref cy_stc_tcpwm_motif_mcp_config_t \ref cy_stc_tcpwm_motif_quaddec_config_t structures respectively.
*
*
* \subsection group_tcpwm_motif_clock Assign Clock Divider
* The clock source must be connected to proper working.
* Any of the peripheral clock dividers could be used. Use the
* \ref group_sysclk driver API to do that.
*
* \subsection group_tcpwm_motif_enable Enable Motion interface module
* MOTIF block has to be enabled before starting
*
*
* \subsection group_tcpwm_motif_start Start MOTIF block
* MOTIF has to be started
*
* \{
*/

/**
* \defgroup group_tcpwm_macros_motif                Macros
* \defgroup group_tcpwm_functions_motif             Functions
* \defgroup group_tcpwm_functions_motif_hall        HALL Sensor specific functions
* \defgroup group_tcpwm_functions_motif_mcp         Multi-Channel specific functions
* \defgroup group_tcpwm_functions_motif_quaddec     Quadrature decoder specific functions
* \defgroup group_tcpwm_data_structures_motif Data Structures
* \} */

/**
* \addtogroup group_tcpwm_macros_motif
* \{
*/
#define CY_MOTIF_CORRECT_HALL_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_CHES_Msk                    /**< Correct Hall Event Status Interrupt  */
#define CY_MOTIF_WRONG_HALL_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_WHES_Msk                      /**< Wrong Hall Event Status Interrupt  */
#define CY_MOTIF_HALL_INPUT_UPDATE_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_HIES_Msk               /**< Hall Inputs Update Event Status Interrupt  */
#define CY_MOTIF_MCP_SHADOW_TRANSFER_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_MSTS_Msk             /**< Multi-Channel pattern shadow transfer status  */
#define CY_MOTIF_QUADRATURE_INDEX_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_INDXS_Msk               /**< Quadrature Index Status Interrupt  */
#define CY_MOTIF_QUADRATURE_PHASE_ERROR_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_ERRS_Msk          /**< Quadrature Phase Error Status Interrupt  */
#define CY_MOTIF_QUADRATURE_CLOCK_ERROR_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_CNTS_Msk          /**< Quadrature CLK error Interrupt  */
#define CY_MOTIF_QUADRATURE_DIRECTION_CHANGE_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_DIRS_Msk     /**< Quadrature Direction Change Interrupt  */
#define CY_MOTIF_QUADRATURE_PERIOD_CLOCK_ERROR_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_PCLKS_Msk  /**< QQuadrature Period Clk Status Interrupt  */
#define CY_MOTIF_CURRENT_PATTERN_MATCH_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_CPES_Msk           /**< Equality between Sampled Hall input values and Current Pattern value detected.  */
#define CY_MOTIF_PREVIOUS_PATTERN_MATCH_EVENT TCPWM_MOTIF_GRP_MOTIF_PFLG_PPES_Msk          /**< Equality between Sampled Hall input values and Previous Pattern value detected.  */

