RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/** Interrupt events in the MOTIF Module */
#define CY_MOTIF_ALL_INTERRUPTS (CY_MOTIF_CORRECT_HALL_EVENT                  |\
                                 CY_MOTIF_WRONG_HALL_EVENT                    |\
                                 CY_MOTIF_HALL_INPUT_UPDATE_EVENT             |\
                                 CY_MOTIF_MCP_SHADOW_TRANSFER_EVENT           |\
                                 CY_MOTIF_QUADRATURE_INDEX_EVENT              |\
                                 CY_MOTIF_QUADRATURE_PHASE_ERROR_EVENT        |\
                                 CY_MOTIF_QUADRATURE_CLOCK_ERROR_EVENT        |\
                                 CY_MOTIF_QUADRATURE_DIRECTION_CHANGE_EVENT   |\
                                 CY_MOTIF_QUADRATURE_PERIOD_CLOCK_ERROR_EVENT |\
                                 CY_MOTIF_CURRENT_PATTERN_MATCH_EVENT         |\
                                 CY_MOTIF_PREVIOUS_PATTERN_MATCH_EVENT)

/** Interrupt events in the MOTIF Module HALL Sensor mode */
#define CY_MOTIF_HALL_INTERRUPTS (CY_MOTIF_CORRECT_HALL_EVENT                  |\
                                  CY_MOTIF_WRONG_HALL_EVENT                    |\
                                  CY_MOTIF_HALL_INPUT_UPDATE_EVENT             |\
                                  CY_MOTIF_MCP_SHADOW_TRANSFER_EVENT           |\
                                  CY_MOTIF_CURRENT_PATTERN_MATCH_EVENT         |\
                                  CY_MOTIF_PREVIOUS_PATTERN_MATCH_EVENT)

/** Interrupt events in the MOTIF Module Multi Channel Pattern Mode */
#define CY_MOTIF_MCP_INTERRUPTS (CY_MOTIF_MCP_SHADOW_TRANSFER_EVENT           |\
                                 CY_MOTIF_CURRENT_PATTERN_MATCH_EVENT         |\
                                 CY_MOTIF_PREVIOUS_PATTERN_MATCH_EVENT)

/** Interrupt events in the MOTIF Module Quadrature Mode */
#define CY_MOTIF_QUDRATURE_INTERRUPTS (CY_MOTIF_QUADRATURE_INDEX_EVENT              |\
                                       CY_MOTIF_QUADRATURE_PHASE_ERROR_EVENT        |\
                                       CY_MOTIF_QUADRATURE_CLOCK_ERROR_EVENT        |\
                                       CY_MOTIF_QUADRATURE_DIRECTION_CHANGE_EVENT   |\
                                       CY_MOTIF_QUADRATURE_PERIOD_CLOCK_ERROR_EVENT)
/** \} group_tcpwm_macros_motif */

/**
* \addtogroup group_tcpwm_data_structures_motif
* \{
*/
/** Enumeration values for Motif mode Configuration */
typedef enum
{
    CY_MOTIF_HALL_SENSOR_MODE               = 0UL,   /**< MOTIF mode is set to HALL Sensor.                      */
    CY_MOTIF_QUAD_DECODER_MODE              = 1UL,   /**< MOTIF mode is set to Quadrature decoder.               */
    CY_MOTIF_STANDALONE_MULTICHANNEL_MODE   = 2UL,   /**< MOTIF mode is set to stand alone multi channel.        */
    CY_MOTIF_SAMC_QD_MODE                   = 3UL,   /**< MOTIF mode is set to stand alone multi channel  and quadrature decoder */
} cy_en_motif_mode_t;

// /** Enumeration values for quadrature mode Configuration */
typedef enum
{
    CY_MOTIF_PD_QUAD_MODE                   = 0UL,   /**< Position decoder in quadrature decoder mode. */
    CY_MOTIF_PD_DIRECTION_COUNT_MODE        = 1UL,   /**< Position decoder in direction count mode.     */
} cy_en_position_decoder_mode_t;

/** Enumeration values for Multi Channel Pattern Update Configuration */
typedef enum
{
    CY_MULTI_CHANNEL_PATTERN_UPDATE_BYHW    = 0UL,    /**< Multichannel pattern updated by Hardware             */
    CY_MULTI_CHANNEL_PATTERN_UPDATE_BYSW    = 1UL,    /**< Multichannel pattern updated by software. multi channel patter will be updated only
                                                           when has  set MCMS register MNPS filed            */
} cy_en_mcp_mode_t;

/** Enumeration values for Motif HALL event Configuration */
typedef enum
{
    CY_WHE_OR_MODULE_PIN                    = 0UL,    /**< OR between Wrong hall event and the module pin is the source for fault or correct event */
    CY_WRONG_HALL_EVENT                     = 1UL,    /**< Wrong hall event is the source for fault or correct event */
    CY_MODULE_PIN                           = 2UL,    /**< the module pin is the source for fault or correct event   */
} cy_en_hall_input_event_selection_t;

/** Enumeration values for Motif Sampling Trigger Configuration */
typedef enum
{
    CY_SAMPLING_TRIGGER_RISING_EDGE         = 0UL,    /**< Rising edge is used of the selected MOTIFx.HSD signal to trigger a sample of the Hall inputs. */
    CY_SAMPLING_TRIGGER_FALLING_EDGE        = 1UL,    /**< Falling edge is used of the selected MOTIFx.HSD signal to trigger a sample of the Hall inputs. */
} cy_en_trigger_edge_selection_t;



/** Enumeration values for Motif Low Pass Filter Configuration */
typedef enum
{
    CY_LOWPASS_FILTER_DISABLED    = 0UL,        /**< Low pass filter is disabled. */
    CY_LOWPASS_OF_1CLOCK_CYCLE    = 1UL,        /**< Low pass of one clock cycle */
    CY_LOWPASS_OF_2CLOCK_CYCLE    = 2UL,        /**< Low pass of two clock cycle */
    CY_LOWPASS_OF_4CLOCK_CYCLE    = 3UL,        /**< Low pass of four clock cycle */
    CY_LOWPASS_OF_8CLOCK_CYCLE    = 4UL,        /**< Low pass of eight clock cycle */
    CY_LOWPASS_OF_16CLOCK_CYCLE   = 5UL,        /**< Low pass of sixteen clock cycle */
    CY_LOWPASS_OF_32CLOCK_CYCLE   = 6UL,        /**< Low pass of thirty two clock cycle */
    CY_LOWPASS_OF_64CLOCK_CYCLE   = 7UL,        /**< Low pass of sixty four clock cycle */
    CY_LOWPASS_OF_128CLOCK_CYCLE  = 8UL,        /**< Low pass of one twenty eight clock cycle */
    CY_LOWPASS_OF_256CLOCK_CYCLE  = 9UL,        /**< Low pass of two fifty six clock cycle */
    CY_LOWPASS_OF_512CLOCK_CYCLE  = 10UL,       /**< Low pass of five twelve clock cycle */
    CY_LOWPASS_OF_1024CLOCK_CYCLE = 11UL,       /**< Low pass of one thousand twenty four clock cycle */
} cy_en_low_pass_filter_config_t;

/** Motif Suspend Configuration */
typedef enum
{
    CY_MOTIF_SUSPEND_REQUEST_IGNORED = 0UL,      /**< Motif suspend request is ignored. motif module continues to run as configured. */
    CY_MOTIF_MODULE_STOP             = 1UL,      /**< Motif module is stopped immediately */
    CY_MOTIF_SUSPEND_NEXT_INDEX      = 2UL,      /**< Motif suspend in the next index for quad mode and quad with stand alone mode. other modes stop immediately */
    CY_MOTIF_SUSPEND_NEXT_PHASE      = 3UL,      /**< Motif suspend in the next phase for quad mode and quad with stand alone mode. other modes stop immediately */
    CY_MOTIF_MODULE_STOP_RESET       = 4UL,      /**< Motif module is stopped immediately. Multi channel pattern is to the reset value */
    CY_MOTIF_SUSPEND_SYNCH           = 5UL,      /**< Suspend with sync of pwm signal. Multi channel pattern is to the reset value. quad mode stop immediately */
} cy_en_motif_suspend_config_t;

/** Hall look up table data */
typedef struct cy_stc_tcpwm_motif_lut
{
    uint8_t             hlut_data_pos0;    /**< Hall look up table data position 0 */
    uint8_t             hlut_data_pos1;    /**< Hall look up table data position 1 */
    uint8_t             hlut_data_pos2;    /**< Hall look up table data position 2 */
    uint8_t             hlut_data_pos3;    /**< Hall look up table data position 3 */
    uint8_t             hlut_data_pos4;    /**< Hall look up table data position 4 */
    uint8_t             hlut_data_pos5;    /**< Hall look up table data position 5 */
}cy_stc_tcpwm_motif_hlut_t;

/** HALL Sensor output event node selection */
typedef enum
{
    CY_IGNORE_HALL_SENSOR_EVENT      = 0UL,   /**< Ignore hall sensor event */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT0 = 1UL,   /**< Forward hall sensor event to out0 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT1 = 2UL,   /**< Forward hall sensor event to out1 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT2 = 3UL,   /**< Forward hall sensor event to out2 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT3 = 4UL,   /**< Forward hall sensor event to out3 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT4 = 5UL,   /**< Forward hall sensor event to out4 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT5 = 6UL,   /**< Forward hall sensor event to out5 */
    CY_FWD_HALL_SENSOR_EVENT_TO_OUT6 = 7UL,   /**< Forward hall sensor event to out6 */
} cy_en_hall_sensor_event_output_node_t;


/** Multi channel pattern output event node selection */
typedef enum
{
    CY_IGNORE_MULTI_CHANNEL_EVENT      = 0UL,   /**< Ignore multi channel event */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT0 = 1UL,   /**< Forward multi channel event to out0 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT1 = 2UL,   /**< Forward multi channel event to out1 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT2 = 3UL,   /**< Forward multi channel event to out2 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT3 = 4UL,   /**< Forward multi channel event to out3 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT4 = 5UL,   /**< Forward multi channel event to out4 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT5 = 6UL,   /**< Forward multi channel event to out5 */
    CY_FWD_MULTI_CHANNEL_EVENT_TO_OUT6 = 7UL,   /**< Forward multi channel event to out6 */
} cy_en_multi_channel_event_output_node_t;



/** Quaddec index marker generation */
typedef enum
{
    CY_QUADDEC_NO_INDEX_MARKER_GENERATION          = 0UL,   /**< No index marker generation. */
    CY_QUADDEC_FIRST_INDEX_OCCURRENCE_GENERATION   = 1UL,   /**< First Index occurrence */
    CY_QUADDEC_ALL_INDEX_OCCURRENCE_GENERATION     = 2UL,   /**< First Index occurrence */
} cy_en_quaddec_index_occurrence_t;

