RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/** Quaddec Phase edge mode. */
typedef enum
{
    CY_TCPWM_DETECT_ON_BOTH_EDGE          = 0UL,   /**< Clock decoded on both rising edge and falling edge */
    CY_TCPWM_DETECT_ON_RISING_EDGE        = 1UL,   /**< Clock decoded on rising edge. */
    CY_TCPWM_DETECT_ON_FALLING_EDGE       = 2UL,   /**< Clock decoded on falling edge */
    CY_TCPWM_IGNORE_EDGE                  = 3UL,   /**< Clock is not decoded. */
} cy_en_tcpwm_edge_config_t;

/** Quaddec clock and index selector */
typedef enum
{
    CY_QUADDEC_DISABLED          = 0UL,   /**< Clock signal is not used in quaddec mode or direction count mode. */
    CY_QUADDEC_POSI0             = 1UL,   /**< Clock signal POSI0 is used in quaddec mode or direction count mode. */
    CY_QUADDEC_POSI1             = 2UL,   /**< Clock signal POSI1 is used in quaddec mode or direction count mode. */
    CY_QUADDEC_POSI2             = 3UL,   /**< Clock signal POSI2 is used in quaddec mode or direction count mode. */
} cy_en_quaddec_signal_selector_t;


/** Quaddec event output node selector */
typedef enum
{
    CY_IGNORE_QUADDEC_EVENT      = 0UL,   /**< Ignore quaddec event */
    CY_FWD_QUADDEC_EVENT_TO_OUT0 = 1UL,   /**< Forward quaddec event to out0 */
    CY_FWD_QUADDEC_EVENT_TO_OUT1 = 2UL,   /**< Forward quaddec event to out1 */
    CY_FWD_QUADDEC_EVENT_TO_OUT2 = 3UL,   /**< Forward quaddec event to out2 */
    CY_FWD_QUADDEC_EVENT_TO_OUT3 = 4UL,   /**< Forward quaddec event to out3 */
    CY_FWD_QUADDEC_EVENT_TO_OUT4 = 5UL,   /**< Forward quaddec event to out4 */
    CY_FWD_QUADDEC_EVENT_TO_OUT5 = 6UL,   /**< Forward quaddec event to out5 */
    CY_FWD_QUADDEC_EVENT_TO_OUT6 = 7UL,   /**< Forward quaddec event to out6 */
} cy_en_quaddec_event_output_node_t;


/** Low pass filter numbers */
typedef enum
{
    CY_LOW_PASS_FILTER_0    = 0UL,        /**< Low pass filter 0  */
    CY_LOW_PASS_FILTER_1    = 1UL,        /**< Low pass filter 1  */
    CY_LOW_PASS_FILTER_2    = 2UL,        /**< Low pass filter 2  */
} cy_en_low_pass_filter_number_t;

/** Multi Channel Look Up table configuration */
typedef struct cy_stc_tcpwm_motif_mlut
{
    uint32_t             mlut_data_pos0;    /**< Multi channel look up table data position 0 */
    uint32_t             mlut_data_pos1;    /**< Multi channel look up table data position 1 */
    uint32_t             mlut_data_pos2;    /**< Multi channel look up table data position 2 */
    uint32_t             mlut_data_pos3;    /**< Multi channel look up table data position 3 */
    uint32_t             mlut_data_pos4;    /**< Multi channel look up table data position 4 */
    uint32_t             mlut_data_pos5;    /**< Multi channel look up table data position 5 */
}cy_stc_tcpwm_motif_mlut_t;

/** User to make sure that all events are not routed to the same node */
typedef struct cy_stc_hall_sensor_output_config
{
    cy_en_hall_sensor_event_output_node_t edge_detect_event_config;         /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t correct_hall_event_config;        /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t idle_wrong_hall_event_config;     /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t start_event_config;               /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t pattern_mismatch_event_config;    /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t curr_pattern_match_event_config;  /**< Forward edge detection event to  */
    cy_en_hall_sensor_event_output_node_t prev_pattern_match_event_config;  /**< Forward edge detection event to  */
}cy_stc_hall_output_config_t;

/** MOTIF Multi channel output configuration structure */
typedef struct cy_stc_multi_channel_output_config
{
    cy_en_multi_channel_event_output_node_t pattern_update_event_config; /**< Forward pattern update event  */
    cy_en_multi_channel_event_output_node_t update_sync_event_config;    /**< Forward update sync event */
    cy_en_multi_channel_event_output_node_t start_event_config;          /**< Forward start event */
}cy_stc_multi_channel_output_config_t;

/** MOTIF configuration structure */
typedef struct cy_stc_tcpwm_motif_hall_sensor_config
{
    cy_en_mcp_mode_t        mcp_mode;                                /**< Multi channel pattern update by Hardware or software */
    cy_en_hall_input_event_selection_t    fault_event_selection;     /**< Event selection for fault HALL Sensor event */
    cy_en_hall_input_event_selection_t    correct_event_selection;   /**< Event selection for correct HALL Sensor event */
    cy_en_trigger_edge_selection_t  edge_for_sampling_trigger;       /**< edge selection for sampling trigger */
    cy_en_trigger_edge_selection_t  edge_for_mset_trigger;           /**< edge selection for Multi-Channel pattern update mset trigger */
    cy_en_trigger_edge_selection_t  edge_for_msync_trigger;          /**< edge selection for Multi-Channel pattern update msync trigger */
    bool external_wrong_hall_event_enable;                           /**< External wrong hall event emulation signal enable or disable */
    bool external_wrong_hall_event_active_level;                     /**< External wrong hall event emulation signal is active high or active low. */
    bool              sync_bypass;                                   /**< Bypasses synchronization signal.
                                                                          0: Update of the Multi-Channel pattern is only done after the sync signal is detected,
                                                                          1: Update of the Multi-Channel pattern is done immediately */
    bool              delay_bypass;                                  /**< will bypass the delay between a Correct Hall Event and the enable of the Multi-Channel Pattern update.
                                                                          0: Multi-Channel Pattern update is only done after the external SET signal is detected.
                                                                          1:  Multi-Channel Pattern update is done immediately after a Correct Hall Event is detected. */
    bool              fault_clear;                                   /**< enable/disable a clear of the Multi-Channel pattern, whenever a Hall Fault Event is detected.
                                                                          0: Multi-Channel pattern clear with Hall Fault Event disabled.
                                                                          1: Multi-Channel pattern clear with Hall Fault Event enabled. */
    bool              debounce_bypass;                                /**< Setting this true, will disable the usage of the debounce delay pins.
                                                                          This means that after the low pass filter, the hall inputs are immediately sampled and compared against the expected and current patterns. */
    bool              pp_compare;                                     /**< Setting this bitfield to 1, enables the compare logic between the sampled hall input values and the previous hall pattern.
                                                                          This will be used together with the comparison of the current and expected pattern to generate a wrong hall event. */
    cy_en_low_pass_filter_config_t low_pass_filter_config;           /**< low pass filter config */
    bool              lut_enable;                                    /**< Setting this bitfield to 1, will enable the usage of the Hall Look-up table.*/
    cy_stc_tcpwm_motif_hlut_t *hlut_config;                          /**< Hall Sensor LUT configuration. Applicable when LUT mode is enabled. */
    cy_stc_tcpwm_motif_mlut_t *mlut_config;                          /**< Multi channel pattern LUT configuration. Applicable when LUT mode is enabled. */
    cy_stc_hall_output_config_t  *output_config;              /**< Configuration for output events of hall sensor */

}cy_stc_tcpwm_motif_hall_sensor_config_t;

/** MOTIF Quadrature mode output configuration structure */
typedef struct cy_stc_quaddec_output_config
{
    cy_en_quaddec_event_output_node_t clock_event_config;           /**< Forward clock event  */
    cy_en_quaddec_event_output_node_t direction_event_config;       /**< Forward direction event */
    cy_en_quaddec_event_output_node_t period_clock_event_config;    /**< Forward period clock event */
    cy_en_quaddec_event_output_node_t clear_capture_event_config;   /**< Forward clear capture event  */
    cy_en_quaddec_event_output_node_t index_event_config;           /**< Forward index event */
    cy_en_quaddec_event_output_node_t start_event_config;           /**< Forward start event */
}cy_stc_quaddec_output_config_t;


/** Quadrature decoder configuration structure */
typedef struct cy_stc_tcpwm_motif_quaddec_config
{
    cy_en_position_decoder_mode_t   position_decoder_mode;           /**< Sets the position decoder mode to either quadrature mode or Direction count mode. */
    bool              phase_A_level_selector;                        /**< Sets Phase A level Selector. 0:Active high, 1: Active Low */
    bool              phase_B_level_selector;                        /**< Sets Phase B level Selector. 0:Active high, 1: Active Low */
    bool              phase_signal_swap;                             /**< 0: Sets Phase A leading signal for clockwise rotation. 1: Sets Phase B leading signal for clockwise rotation. */
    bool              index_signal_level_selector;                   /**< Sets Index signal level Selector. 0:Active high, 1: Active Low */
    cy_en_quaddec_index_occurrence_t    progindex_occurrence;        /**< Sets PROGIndex output event occurrence configuration. */
    cy_en_tcpwm_edge_config_t           phae_A_edge_mode;            /**< Sets edge mode for Phase A */
    cy_en_tcpwm_edge_config_t           phae_B_edge_mode;            /**< Sets edge mode for Phase B */
    cy_en_quaddec_signal_selector_t     clock_signal_for_phase_A;    /**< Sets input signal for Phase A */
    cy_en_quaddec_signal_selector_t     clock_signal_for_phase_B;    /**< Sets input signal for Phase B */
    cy_en_quaddec_signal_selector_t     clock_signal_for_index;      /**< Sets input signal for index */
    cy_en_low_pass_filter_config_t      low_pass_filter_config;      /**< low pass filter config */
    cy_stc_quaddec_output_config_t      *output_config;              /**< Configuration for output events of quaddec */
}cy_stc_tcpwm_motif_quaddec_config_t;


/** Multi Channel mode configuration structure */
typedef struct cy_stc_tcpwm_motif_mcp_config
{
    bool              sync_bypass;    /**< Bypasses synchronization signal.
                                           0: Update of the Multi-Channel pattern is only done after the sync signal is detected,
                                           1: Update of the Multi-Channel pattern is done immediately */
    cy_en_mcp_mode_t        mcp_mode;                          /**< Multi channel pattern update by Hardware or software */
    cy_en_trigger_edge_selection_t  edge_for_mset_trigger;     /**< edge selection for mset trigger */
    cy_en_trigger_edge_selection_t  edge_for_msync_trigger;    /**< edge selection for msync trigger */
    bool              lut_enable;                              /**< Setting this bitfield to 1, will enable the usage of the Hall Look-up table.*/
    cy_stc_tcpwm_motif_mlut_t *mlut_config;                    /**< Multi channel pattern LUT configuration. Applicable when LUT mode is enabled. */
    cy_stc_multi_channel_output_config_t *output_config;       /**< Configuration for output events of mcp */

}cy_stc_tcpwm_motif_mcp_config_t;


/** Multi Channel mode and quaddec configuration structure */
typedef struct cy_stc_tcpwm_motif_mcp_quaddec_config
{
    cy_stc_tcpwm_motif_mcp_config_t       *mcp_config;       /**< multi channel pattern config */
    cy_stc_tcpwm_motif_quaddec_config_t   *quaddec_config;   /**< Quad decoding config */
}cy_stc_tcpwm_motif_mcp_quaddec_config_t;

/** \} group_tcpwm_data_structures_motif */


/**
* \addtogroup group_tcpwm_functions_motif
* \{
*/

