RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
__STATIC_INLINE void Cy_TCPWM_MOTIF_Enable(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Disable(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Start(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Stop(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_DeInit(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Suspend(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_motif_suspend_config_t suspend_config);
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_GetInterruptStatus(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_ClearInterrupt(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask);
__STATIC_INLINE void Cy_TCPWM_MOTIF_SetInterrupt(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask);
__STATIC_INLINE void Cy_TCPWM_MOTIF_SetInterruptMask(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask);
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_GetInterruptMask(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE uint8_t Cy_TCPWM_MOTIF_Get_LUT_Status(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_LUT_Mode(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool lut_enable);


/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Get_Lowpass_Filter_Status
***************************************************************************//**
*
* Returns the status of the low pass filter.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param lowpass_filter low pass filter. \ref cy_en_low_pass_filter_number_t
*
* \return The status of the low pass filter
*
******************************************************************************/
uint16_t Cy_TCPWM_MOTIF_Get_Lowpass_Filter_Status(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_low_pass_filter_number_t lowpass_filter);

/** \} group_tcpwm_functions_motif */


/**
* \addtogroup group_tcpwm_functions_motif_hall
* \{
*/

__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_HLUT(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_hlut_t *hlut_config);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Configure_Debounce_Bypass(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_sd);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Hall_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Previous_Pattern_Compare(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool pp_compare);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_HALL_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint8_t current_pattern, uint8_t expected_pattern, uint8_t previous_pattern);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Hall_Input_Sample_Trigger(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_hall_output_config_t *output_config);
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_HALL_Get_Output_Modulation_Value(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Sample_Trigger_EdgeSel(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_trigger_edge_selection_t edge_select);

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Hall_Sensor_Init
***************************************************************************//**
*
* MOTIF module initialization in Hall sensor Mode
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param config Hall sensor configuration \ref cy_stc_tcpwm_motif_hall_sensor_config_t
*
* \return Returns the status of the operation.
*
*******************************************************************************/
cy_en_tcpwm_status_t Cy_TCPWM_MOTIF_Hall_Sensor_Init(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_hall_sensor_config_t const *config);

/** \} group_tcpwm_functions_motif_hall */


/**
* \addtogroup group_tcpwm_functions_motif_mcp
* \{
*/

__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_MCP_Value(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mcp_value);
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Value_When_Fault_Hall(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mcp_value);
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Bypass_Delay(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_delay);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Clear_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Clear_Updation_Of_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern_Immediately(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE bool Cy_TCPWM_MOTIF_Get_Multi_Channel_Pattern_Update_Status(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_SW_Update_Enable(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool sw_update_enable);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Multi_Channel_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_multi_channel_output_config_t *output_config);
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Bypass_Synchronization(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_sync);

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Update_MLUT
***************************************************************************//**
*
* Update look up table for multi channel pattern MLUT mode
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mlut_config  Multi Channel Pattern Look UP Table values. \ref cy_stc_tcpwm_motif_mlut_t
*
* \note Update look up table for multi channel pattern MLUT
*   User writes HLUT and MLUT when MOTIF is stopped.
*   Writing into both LUT while MOTIF is started might lead to incorrect behavior.
*   The LUT is loaded with forward or reverse pattern depending on motor desired direction.
*   The pattern is stored in LUT independently from motor position.
*   The hardware is responsible to find out the current motor position and to load the right hall and modulation pattern.
*   HLUT and MLUT share the same hardware pointer for data extraction, therefore user needs to take care of keeping them aligned with respect to LUT address.
*   A wrong programming might lead to incorrect behavior.
******************************************************************************/
void Cy_TCPWM_MOTIF_Update_MLUT(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_mlut_t *mlut_config);

