RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_Init
***************************************************************************//**
*
* MOTIF module initialization in Multi Channel Pattern Mode
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mcp_config Multi Channel Pattern configuration \ref cy_stc_tcpwm_motif_mcp_config_t
*
* \return Returns the status of the operation.
*
******************************************************************************/
cy_en_tcpwm_status_t Cy_TCPWM_MOTIF_MCP_Init(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_mcp_config_t const *mcp_config);

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_Quaddec_Init
***************************************************************************//**
*
* MOTIF module initialization in Quadrature Decoder Mode and Multi Channel Pattern mode.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mcp_quad_config MCP and Quad configuration \ref cy_stc_tcpwm_motif_mcp_quaddec_config_t
*
* \return Returns the status of the operation.
*
*
******************************************************************************/
cy_en_tcpwm_status_t Cy_TCPWM_MOTIF_MCP_Quaddec_Init(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_mcp_quaddec_config_t const *mcp_quad_config);

/** \} group_tcpwm_functions_motif_mcp */


/**
* \addtogroup group_tcpwm_functions_motif_quaddec
* \{
*/

__STATIC_INLINE void Cy_TCPWM_MOTIF_Configure_Postion_Decoder_Mode(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_position_decoder_mode_t mode);
__STATIC_INLINE bool Cy_TCPWM_MOTIF_Get_Quaddec_Rotation_Direction(TCPWM_MOTIF_GRP_MOTIF_Type *base);
__STATIC_INLINE void Cy_TCPWM_MOTIF_Quaddec_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_quaddec_output_config_t *output_config);

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Quaddec_Init
***************************************************************************//**
*
* MOTIF module initialization in Quadrature Decoder Mode
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param config Quadrature decoder configuration \ref cy_stc_tcpwm_motif_quaddec_config_t
*
* \return Returns the status of the operation.
*
******************************************************************************/
cy_en_tcpwm_status_t Cy_TCPWM_MOTIF_Quaddec_Init(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_quaddec_config_t const *config);


/** \} group_tcpwm_functions_motif_quaddec */


/**
* \addtogroup group_tcpwm_functions_motif
* \{
*/


/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_DeInit
***************************************************************************//**
*
* De initializes MOTIF block.
*
* param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_DeInit(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_PCONF(base), TCPWM_MOTIF_GRP_MOTIF_PCONF_ENABLE, 0U);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Suspend
***************************************************************************//**
*
* Configures the entering in suspend for the MOTIF module.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param suspend_config \ref cy_en_motif_suspend_config_t
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Suspend(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_motif_suspend_config_t suspend_config)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_PSUS(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_PSUS_SUS, suspend_config));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Set_LUT_Mode
***************************************************************************//**
*
* Enables/disables LUT mode.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param lut_enable LUT mode enable disable
*
* \note HALL Sensor works in LUT mode enabled and disabled. When LUT mode is enabled user provides look up table values
*   and they will be compared with the actual output values. When motor changes direction, MOTIF is stopped and
*   user need to populate the LUT again.
* \note This function is used to enable disable LUT mode. Sam function for both HALL Sensor mode and Multi channel pattern mode
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_LUT_Mode(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool lut_enable)
{
    CY_ASSERT_L1(NULL != base);
    /* Each MOTIF module contains two LUT's(Look Up Tables). Hall LUT (HLUT, also called "input LUT") and Modulation LUT (MLUT, also called "output LUT").
       HLUT contains Hall input pattern which gets loaded to HALP registers.
       MLUT contains output PWM modulation pattern which gets loaded to MCM.MCMP register.
       HLUT is 3x6 bits. MLUT is 32x6 bits
     */
    CY_REG32_CLR_SET(TCPWM_MOTIF_CLUT(base), TCPWM_MOTIF_GRP_MOTIF_CLUT_LUTEN, lut_enable);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Get_LUT_Status
***************************************************************************//**
*
* Returns a value that points to the corresponding input Hall LUT values set
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \return value that points to the corresponding input Hall LUT values set
*
* \note If LUT mode is not enabled this function returns always 0.
*  In Lut mode the Valid values that this function return are 0,1,2,3,4,5. Each value points to the corresponding input Hall LUT values set.
*  Invalid values are 6,7
******************************************************************************/
__STATIC_INLINE uint8_t Cy_TCPWM_MOTIF_Get_LUT_Status(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return (uint8_t)(_FLD2VAL(TCPWM_MOTIF_GRP_MOTIF_SLUT_PTR, TCPWM_MOTIF_SLUT(base)));
}

