RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_GetInterruptStatus
***************************************************************************//**
*
* Reports the status of the interrupts
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \return returns the Status of the interrupts
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_GetInterruptStatus(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return TCPWM_MOTIF_PFLG(base);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_ClearInterrupt
***************************************************************************//**
*
* Clears the triggered interrupts
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mask interrupts to be cleared.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_ClearInterrupt(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_RPFLG(base) = mask;
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_SetInterrupt
***************************************************************************//**
*
* Software option to set the required interrupts. Interrupt handler will be called.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mask interrupts to be set.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_SetInterrupt(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_SPFLG(base) = mask;
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_SetInterruptMask
***************************************************************************//**
*
* Sets one or more MOTIF module interrupt factor bits (sets the INTR_MASK register).
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mask interrupt Interrupt bit mask
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_SetInterruptMask(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mask)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_PFLGE(base) = mask;
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_GetInterruptMask
***************************************************************************//**
*
* Reports the interrupt mask set
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \return returns the interrupt mask set
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_GetInterruptMask(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);
    return TCPWM_MOTIF_PFLGE(base);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Enable
***************************************************************************//**
*
* Enables the MOTIF module. Modulation output from motif is started with it's default values
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Enable(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_PCONF(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_PCONF_ENABLE, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Disable
***************************************************************************//**
*
* Disables the MOTIF Module. Modulation output from motif is reset to it's default value
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Disable(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_PCONF(base), TCPWM_MOTIF_GRP_MOTIF_PCONF_ENABLE, 0U);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Start
***************************************************************************//**
*
* Modulation output from motif is started with existing values
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Start(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_PRUNS(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_PRUNS_SRB, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Stop
***************************************************************************//**
*
* Modulation output from motif retains the existing values and MOTIF functionality Stops.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Stop(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);
    /* Output events gets reset to default value,
     *Interrupt output get reset to default value and modulation output keep the existing value
     */
    TCPWM_MOTIF_PRUNS(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_PRUNS_SRB, 0U));
}

/** \} group_tcpwm_functions_motif */


/**
* \addtogroup group_tcpwm_functions_motif_hall
* \{
*/

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Configure_Debounce_Bypass
***************************************************************************//**
*
* Enable/Disable HALL Sensor debounce stage bypass
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param bypass_sd Passing true will disable HALL Sensor sample delay. hall inputs are immediately sample after the low pass filter with out delay.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Configure_Debounce_Bypass(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_sd)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_HMEC(base), TCPWM_MOTIF_GRP_MOTIF_HMEC_HDBP, bypass_sd);
}

