RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Update_Hall_Pattern
***************************************************************************//**
*
* Update Hall pattern immediately.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \note The update of the fields HALP.HCP, HALP.HEP and HALP.HPP can come from software by calling this function.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Hall_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCMS(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCMS_STHR, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_HALL_Previous_Pattern_Compare
***************************************************************************//**
*
* Enable/Disable HALL Previous Pattern compare
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param pp_compare Previous Pattern Compare enable or disable
*
* \note Passing true will enables the compare logic between the sampled hall input values and the previous hall pattern.
*   HALP.HPP will hold the previous pattern.
*   This will be used together with the comparison of the current and expected pattern to generate a wrong hall event.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Previous_Pattern_Compare(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool pp_compare)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_HMEC(base), TCPWM_MOTIF_GRP_MOTIF_HMEC_HPPE, pp_compare);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Set_HALL_Pattern
***************************************************************************//**
*
* Sets the Hall patterns: Current, Expected and Previous patterns
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param current_pattern Current Pattern
*
* \param expected_pattern Expected Pattern
*
* \param previous_pattern Previous Pattern
*
* \note When the sampling trigger is sensed, the Hall inputs are stored and compared against the Current Pattern, HALP.HCP,
*   the Expected Hall Pattern, HALP.HEP and the Previous Pattern HALP.HPP (the Previous Pattern comparison can be disabled)
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_HALL_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint8_t current_pattern, uint8_t expected_pattern, uint8_t previous_pattern)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_HALPS(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HCPS0, current_pattern) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HEPS1, expected_pattern)|
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HPPS2, previous_pattern));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Hall_Input_Sample_Trigger
***************************************************************************//**
*
* The application software can issue/request a sample of the Hall Inputs
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Hall_Input_Sample_Trigger(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_HIST(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HIST_HIS, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Update_HLUT
***************************************************************************//**
*
* Update look up table contents for Hall Sensor in LUT mode.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param hlut_config HALL Look Up Table Configuration \ref cy_stc_tcpwm_motif_hlut_t
*
* \note Update look up table contents for Hall Sensor in LUT mode.
*   User writes HLUT and MLUT when MOTIF is stopped.
*   Writing into both LUT while MOTIF is started might lead to incorrect behavior.
*   The LUT is loaded with forward or reverse pattern depending on motor desired direction.
*   The pattern is stored in LUT independently from motor position.
*   The hardware is responsible to find out the current motor position and to load the right hall and modulation pattern.
*   HLUT and MLUT share the same hardware pointer for data extraction, therefore user needs to take care of keeping them aligned with respect to LUT address.
*   A wrong programming might lead to incorrect behavior.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_HLUT(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_tcpwm_motif_hlut_t *hlut_config)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != hlut_config);

    TCPWM_MOTIF_HALPS(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HCPS0, hlut_config->hlut_data_pos0) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HEPS1, hlut_config->hlut_data_pos1) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HPPS2, hlut_config->hlut_data_pos2) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HLUT3, hlut_config->hlut_data_pos3) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HLUT4, hlut_config->hlut_data_pos4) |
                               _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HALPS_HLUT5, hlut_config->hlut_data_pos5));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_HALL_Output_Config
***************************************************************************//**
*
* Configures the output pins for each of the hall event.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param output_config HALL Output Configuration \ref cy_stc_hall_output_config_t
*
* \note User to make sure that no two event s are routed to same node.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_hall_output_config_t *output_config)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_HOSC(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_EDN,  output_config->edge_detect_event_config)        |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_CHN,  output_config->correct_hall_event_config)       |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_IDN,  output_config->idle_wrong_hall_event_config)    |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_HSTN, output_config->start_event_config)              |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_SPN,  output_config->pattern_mismatch_event_config)   |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_CPN,  output_config->curr_pattern_match_event_config) |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_HOSC_PPN,  output_config->prev_pattern_match_event_config));
}

