RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_HALL_Get_Output_Modulation_Value
***************************************************************************//**
*
* Returns the output modulation value.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_TCPWM_MOTIF_HALL_Get_Output_Modulation_Value(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return (uint32_t) (_FLD2VAL(TCPWM_MOTIF_GRP_MOTIF_MCM_MCMP, TCPWM_MOTIF_MCM(base)));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_HALL_Sample_Trigger_EdgeSel
***************************************************************************//**
*
* Select the active edge to trigger a sample of the Hall inputs.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param edge_select Edge to trigger a sample of the Hall inputs \ref cy_en_trigger_edge_selection_t.
*
* \note Edge selector for the sampling trigger
*       This field selects which edge is used of the selected MOTIFx.HSD signal to trigger a sample of the Hall inputs.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_HALL_Sample_Trigger_EdgeSel(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_trigger_edge_selection_t edge_select)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_PCONF(base), TCPWM_MOTIF_GRP_MOTIF_PCONF_SPES, edge_select);
}

/** \} group_tcpwm_functions_motif_hall */

/**
* \addtogroup group_tcpwm_functions_motif_mcp
* \{
*/

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Set_MCP_Value
***************************************************************************//**
*
* Sets Multi channel pattern value.
* Every time a multi channel pattern transfer is triggered, this value is transferred.
* This is applicable when multi channel look up table mode is disabled.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mcp_value Multi Channel Pattern Value
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Set_MCP_Value (TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mcp_value)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCSM(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCSM_MCMPS, mcp_value));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_Value_When_Fault_Hall
***************************************************************************//**
*
* Sets MCP value when there is a fault HALL event.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mcp_value Multi channel pattern value to be configured when there is a fault HALL event.
*
* \note It is possible also to use the Hall Fault Event to clear/load the Multi-Channel Pattern with a pre-configured value - MCPF.MCFV.
*  This mechanism can be used whenever a wrong operation is detected and a specific safe pattern needs to be applied to the PWM timers that are controlling the output switches.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Value_When_Fault_Hall(TCPWM_MOTIF_GRP_MOTIF_Type *base, uint32_t mcp_value)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCPF(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCPF_MCFV, mcp_value));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_Bypass_Delay
***************************************************************************//**
*
* Enable/Disable multi channel pattern delay bypass
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param bypass_delay Bypass Delay.
*
* \note After the Correct Hall Event is detected, a delay can be generated between this detection and the update of the Multi-Channel pattern.
*   The delay for the update of the Multi-Channel pattern can be controlled directly by a TCPWM counter.
*   The trigger that indicates that the delay is finished, is mapped to input MOTIFx.MSET (input for MCP trigger)
*   This delay can be by passed by passing true to this function
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Bypass_Delay(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_delay)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_MCMEC(base), TCPWM_MOTIF_GRP_MOTIF_MCMEC_MEBP, bypass_delay);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern
***************************************************************************//**
*
* Update multi channel pattern.
* The update is not done immediately due to the fact that the trigger that synchronizes the update with the PWM is still needed
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \note Calling this function enables the Multi-Channel pattern update.
*  The update is not done immediately due to the fact that the trigger that synchronizes the update with the PWM is still needed.
 * The input MOTIFx.MSYNC is used for synchronization.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCMS(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCMS_MNPS, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Clear_Multi_Channel_Pattern
***************************************************************************//**
*
* Clears the Multi-Channel Pattern value with the content of the MCP Fault register
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Clear_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCMC(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCMC_MPC, 1U));
}

