RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Clear_Updation_Of_Multi_Channel_Pattern
***************************************************************************//**
*
* Clears updating of multi channel pattern. Sets that Multi channel pattern is not ready to be updated.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Clear_Updation_Of_Multi_Channel_Pattern(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCMC(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCMC_MNPC, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern_Immediately
***************************************************************************//**
*
* Update multi channel pattern immediately.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \note Calling this function enables the Multi-Channel pattern update immediately.
*   The update is done immediately with out waiting for the trigger that synchronizes the update with the PWM.
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern_Immediately(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    TCPWM_MOTIF_MCMS(base) |= (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MCMS_STMR, 1U));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Get_Multi_Channel_Pattern_Update_Status
***************************************************************************//**
*
* returns the Multi Channel Pattern update status.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \return indicates if the Multi-Channel pattern is ready to be updated or not. 1: MCP is ready and 0: MCP is not ready.
*
******************************************************************************/
__STATIC_INLINE bool Cy_TCPWM_MOTIF_Get_Multi_Channel_Pattern_Update_Status(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return (bool) (_FLD2VAL(TCPWM_MOTIF_GRP_MOTIF_MCMF_MSS, TCPWM_MOTIF_MCMF(base)));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_SW_Update_Enable
***************************************************************************//**
*
* Selects the source that enables an update of the Multi-Channel pattern.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param sw_update_enable When set to true, the Multi-Channel pattern can only be updated after the SW has called the function Cy_TCPWM_MOTIF_Update_Multi_Channel_Pattern.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_SW_Update_Enable(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool sw_update_enable)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_PCONF(base), TCPWM_MOTIF_GRP_MOTIF_PCONF_MCUE, sw_update_enable);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Multi_Channel_Output_Config
***************************************************************************//**
*
* Configures the output nodes for each of the Multi Channel Pattern output event
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param output_config Output configuration. \ref cy_stc_multi_channel_output_config_t
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Multi_Channel_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_multi_channel_output_config_t *output_config)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != output_config);

    TCPWM_MOTIF_MOSC(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MOSC_PUN,  output_config->pattern_update_event_config)  |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MOSC_SHN,  output_config->update_sync_event_config)     |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_MOSC_MSTN, output_config->start_event_config));
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_MCP_Bypass_Synchronization
***************************************************************************//**
*
* Synchronization of the trigger with the PWM is bypassed if set
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param bypass_sync Synchronization bypass configuration.
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_MCP_Bypass_Synchronization(TCPWM_MOTIF_GRP_MOTIF_Type *base, bool bypass_sync)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_MCMEC(base), TCPWM_MOTIF_GRP_MOTIF_MCMEC_MSBP, bypass_sync);
}

/** \} group_tcpwm_functions_motif_mcp */

/**
* \addtogroup group_tcpwm_functions_motif_quaddec
* \{
*/

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Configure_Postion_Decoder_Mode
***************************************************************************//**
*
* Configures Position Decoder to either Quad mode or direction count mode based on the selection.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param mode Mode to be set for the position decoder. \ref cy_en_position_decoder_mode_t
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Configure_Postion_Decoder_Mode(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_en_position_decoder_mode_t mode)
{
    CY_ASSERT_L1(NULL != base);

    CY_REG32_CLR_SET(TCPWM_MOTIF_PCONF(base), TCPWM_MOTIF_GRP_MOTIF_PCONF_QDCM, mode);
}

/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Get_Quaddec_Rotation_Direction
***************************************************************************//**
*
* returns the quaddec rotation direction.
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \return returns the quaddec rotation direction. 0: Counter clockwise rotation. 1: Clockwise Rotation
*
******************************************************************************/
__STATIC_INLINE bool Cy_TCPWM_MOTIF_Get_Quaddec_Rotation_Direction(TCPWM_MOTIF_GRP_MOTIF_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return (bool)(_FLD2VAL(TCPWM_MOTIF_GRP_MOTIF_QDC_DVAL, TCPWM_MOTIF_QDC(base)));
}

