RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_tcpwm_motif.h
/******************************************************************************
* Function Name: Cy_TCPWM_MOTIF_Quaddec_Output_Config
***************************************************************************//**
*
* Configures the output nodes for each of the quaddec output event
*
* \param base The pointer to the TCPWM_MOTIF instance address.
*
* \param output_config Output configuration. \ref cy_stc_quaddec_output_config_t
*
******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_MOTIF_Quaddec_Output_Config(TCPWM_MOTIF_GRP_MOTIF_Type *base, cy_stc_quaddec_output_config_t *output_config)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != output_config);

    TCPWM_MOTIF_QOSC(base) = (_VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_QCN,  output_config->clock_event_config)         |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_DON,  output_config->direction_event_config)     |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_PCN,  output_config->period_clock_event_config)  |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_CCN,  output_config->clear_capture_event_config) |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_IXN,  output_config->index_event_config)         |
                              _VAL2FLD(TCPWM_MOTIF_GRP_MOTIF_QOSC_QSTN, output_config->start_event_config));

}

/** \} group_tcpwm_functions_motif_quaddec */


#if defined(__cplusplus)
}
#endif
#endif /*defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN) */
#endif /* CY_IP_MXTCPWM */

#endif /* CY_TCPWM_MOTIF_H */

